Table of Contents
 Class OpenModel
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Open model
public class OpenModel
Inheritance
object
OpenModel
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpenModel()
Constructor
public OpenModel()
Properties
 ArcSegment3D
List of ArcSegment3D
public List<ArcSegment3D> ArcSegment3D { get; set; }
Property Value
List<ArcSegment3D>
 Attribute
List of attributes
public List<OpenAttribute> Attribute { get; set; }
Property Value
List<OpenAttribute>
 Beam
List of Elements 1D
public List<Beam> Beam { get; set; }
Property Value
List<Beam>
 CheckMember
List of the Check members
public List<CheckMember> CheckMember { get; set; }
Property Value
List<CheckMember>
 CombiInput
List of Combinations
public List<CombiInput> CombiInput { get; set; }
Property Value
List<CombiInput>
 ConcreteCheckSection
List of the concrete check section
public List<CheckSection> ConcreteCheckSection { get; set; }
Property Value
List<CheckSection>
 ConcreteSetup
Gets or sets the concrete member data
public ConcreteSetup ConcreteSetup { get; set; }
Property Value
ConcreteSetup
 ConnectionPoint
List of Connection Points
public List<ConnectionPoint> ConnectionPoint { get; set; }
Property Value
List<ConnectionPoint>
 ConnectionSetup
Information about Connection Setup
public ConnectionSetup ConnectionSetup { get; set; }
Property Value
ConnectionSetup
 Connections
List of Connection data
public List<ConnectionData> Connections { get; set; }
Property Value
List<ConnectionData>
 CrossSection
List of CrossSection
public List<CrossSection> CrossSection { get; set; }
Property Value
List<CrossSection>
 DappedEnd
List of dapped ends in Detail
public List<DappedEnd> DappedEnd { get; set; }
Property Value
List<DappedEnd>
 DesignMember
Design Member
public List<DesignMember> DesignMember { get; set; }
Property Value
List<DesignMember>
 Element1D
List of Elements 1D
public List<Element1D> Element1D { get; set; }
Property Value
List<Element1D>
 Element2D
List of Elements 2D
public List<Element2D> Element2D { get; set; }
Property Value
List<Element2D>
 HingeElement1D
List of hinge elements 1D
public List<HingeElement1D> HingeElement1D { get; set; }
Property Value
List<HingeElement1D>
 ISDModel
List of Details
public List<ISDModel> ISDModel { get; set; }
Property Value
List<ISDModel>
 InitialImperfectionOfPoint
List of InitialmperfectionOfPoint
public List<InitialImperfectionOfPoint> InitialImperfectionOfPoint { get; set; }
Property Value
List<InitialImperfectionOfPoint>
 LineSegment3D
List of LineSegment3D
public List<LineSegment3D> LineSegment3D { get; set; }
Property Value
List<LineSegment3D>
 LineSupportSegment
List of Line support on segment
public List<LineSupportSegment> LineSupportSegment { get; set; }
Property Value
List<LineSupportSegment>
 LoadCase
List of Load cases
public List<LoadCase> LoadCase { get; set; }
Property Value
List<LoadCase>
 LoadGroup
List of Load groups
public List<LoadGroup> LoadGroup { get; set; }
Property Value
List<LoadGroup>
 LoadsInPoint
List of point load impulses in this load case
public List<LoadInPoint> LoadsInPoint { get; set; }
Property Value
List<LoadInPoint>
 LoadsOnLine
List of line load impulses in this load case
public List<LoadOnLine> LoadsOnLine { get; set; }
Property Value
List<LoadOnLine>
 LoadsOnSurface
List surafce load in this load case
public List<LoadOnSurface> LoadsOnSurface { get; set; }
Property Value
List<LoadOnSurface>
 MatConcrete
List of MatConcrete
public List<MatConcrete> MatConcrete { get; set; }
Property Value
List<MatConcrete>
 MatPrestressSteel
List of MatPrestressSteel
public List<MatPrestressSteel> MatPrestressSteel { get; set; }
Property Value
List<MatPrestressSteel>
 MatReinforcement
List of MatReinforcement
public List<MatReinforcement> MatReinforcement { get; set; }
Property Value
List<MatReinforcement>
 MatSteel
List of MatSteel
public List<MatSteel> MatSteel { get; set; }
Property Value
List<MatSteel>
 Member1D
List of Member 1D
public List<Member1D> Member1D { get; set; }
Property Value
List<Member1D>
 Member2D
List of Member 2D
public List<Member2D> Member2D { get; set; }
Property Value
List<Member2D>
 Opening
List of openings for Detail
public List<Opening> Opening { get; set; }
Property Value
List<Opening>
 OriginSettings
Information about origin project
public OriginSettings OriginSettings { get; set; }
Property Value
OriginSettings
 PatchDevice
List of dapped ends in Detail
public List<PatchDevice> PatchDevice { get; set; }
Property Value
List<PatchDevice>
 Point3D
List of Point3D
public List<Point3D> Point3D { get; set; }
Property Value
List<Point3D>
 PointLoadsOnLine
List of point load impulses in this load case
public List<PointLoadOnLine> PointLoadsOnLine { get; set; }
Property Value
List<PointLoadOnLine>
 PointOnLine3D
List of Point on line 3D
public List<PointOnLine3D> PointOnLine3D { get; set; }
Property Value
List<PointOnLine3D>
 PointSupportNode
List of Point support in node
public List<PointSupportNode> PointSupportNode { get; set; }
Property Value
List<PointSupportNode>
 PolyLine3D
List of PolyLine3D
public List<PolyLine3D> PolyLine3D { get; set; }
Property Value
List<PolyLine3D>
 ProjectData
Gets or sets the projet data
public ProjectData ProjectData { get; set; }
Property Value
ProjectData
 ProjectDataConcrete
Gets or sets the projet data concrete
public ProjectDataConcrete ProjectDataConcrete { get; set; }
Property Value
ProjectDataConcrete
 RebarGeneral
Gets or sets the rebar General collection
public List<RebarGeneral> RebarGeneral { get; set; }
Property Value
List<RebarGeneral>
 RebarShape
Gets or sets the rebars shapes
public List<RebarShape> RebarShape { get; set; }
Property Value
List<RebarShape>
 RebarSingle
Gets or sets the rebar single collection
public List<RebarSingle> RebarSingle { get; set; }
Property Value
List<RebarSingle>
 RebarStirrups
Gets or sets the rebar group (stirrups) collection
public List<RebarStirrups> RebarStirrups { get; set; }
Property Value
List<RebarStirrups>
 Region3D
List of Region3D
public List<Region3D> Region3D { get; set; }
Property Value
List<Region3D>
 ReinforcedCrossSection
List of Reinforced CrossSection
public List<ReinforcedCrossSection> ReinforcedCrossSection { get; set; }
Property Value
List<ReinforcedCrossSection>
 Reinforcement
List of reinforcement in IDEA StatiCa Detail
public List<Reinforcement> Reinforcement { get; set; }
Property Value
List<Reinforcement>
 ResultClass
Result Class
public List<ResultClass> ResultClass { get; set; }
Property Value
List<ResultClass>
 RigidLink
List of Rigid link
public List<RigidLink> RigidLink { get; set; }
Property Value
List<RigidLink>
 Settlements
Settlements in this load case
public List<Settlement> Settlements { get; set; }
Property Value
List<Settlement>
 Span
public List<Span> Span { get; set; }
Property Value
List<Span>
 StrainLoadsOnLine
List of generalized strain load impulses along the line in this load case.
public List<StrainLoadOnLine> StrainLoadsOnLine { get; set; }
Property Value
List<StrainLoadOnLine>
 SubStructure
Design Member
public List<SubStructure> SubStructure { get; set; }
Property Value
List<SubStructure>
 Taper
public List<Taper> Taper { get; set; }
Property Value
List<Taper>
 TemperatureLoadsOnLine
List of temperature load in this load case
public List<TemperatureLoadOnLine> TemperatureLoadsOnLine { get; set; }
Property Value
List<TemperatureLoadOnLine>
 Tendon
Tendon
public List<Tendon> Tendon { get; set; }
Property Value
List<Tendon>
 Version
Data format version
public int Version { get; set; }
Property Value
int
 Wall
List of Elements 2D
public List<Wall> Wall { get; set; }
Property Value
List<Wall>
Methods
 AddObject(OpenAttribute)
Add new atribute object into collections
public int AddObject(OpenAttribute obj)
Parameters
obj OpenAttribute
Added object
Returns
int
Return value 0 - OK, -1 - false
 AddObject(OpenElementId)
Add new object into collections
public int AddObject(OpenElementId obj)
Parameters
obj OpenElementId
Added object
Returns
int
Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks
If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.
 GetExistingObject(OpenElementId)
Add new object into collections
public OpenElementId GetExistingObject(OpenElementId obj)
Parameters
obj OpenElementId
Added object
Returns
OpenElementId
Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks
If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.
 GetMaxId(OpenElementId)
Get max Id value for specified type
public int GetMaxId(OpenElementId obj)
Parameters
obj OpenElementId
Object
Returns
int
Max Id value or zero if don't any exists
 GetMaxId(string)
Get max Id value for specified type
public int GetMaxId(string typeName)
Parameters
typeName string
Name of type
Returns
int
Max Id value or zero if don't any exists
 GetMaxId(Type)
Get max Id value for specified type
public int GetMaxId(Type t)
Parameters
t Type
Type
Returns
int
Max Id value or zero if don't any exists
 GetObject(ReferenceElement)
Gets the Open element object from the Reference element
public OpenElementId GetObject(ReferenceElement element)
Parameters
element ReferenceElement
Reference element
Returns
OpenElementId
The instance of OpenElementId object
 LoadFromStream(Stream)
Creates the instance of Open Model from the stream
public static OpenModel LoadFromStream(Stream xmlFileStream)
Parameters
xmlFileStream Stream
The input stream
Returns
OpenModel
The new instance of Open Model
 LoadFromString(string)
Creates the instance of Open Model from xml string
public static OpenModel LoadFromString(string xmlString)
Parameters
xmlString string
The input string
Returns
OpenModel
The new instance of Open Model
 LoadFromXmlFile(string)
Creates the instance of Open Model from the XML file
public static OpenModel LoadFromXmlFile(string xmlFileName)
Parameters
xmlFileName string
XML file name
Returns
OpenModel
Open Model or null
 ReferenceElementsReconstruction(bool)
Should be called after deserialization of the open model from xml
public void ReferenceElementsReconstruction(bool renewReferences = false)
Parameters
renewReferences bool
 SaveToXmlFile(string)
Saves content into file as a XML format
public bool SaveToXmlFile(string xmlFileName)
Parameters
xmlFileName string
XML file name
Returns
bool
True if succeeded
 Edit this page